Time=[58.82,43.54,31.31,22.31,23.87,23.08,21.21,19.47,17.35,16.10,15,13.42,11.09,8.78,6.73,4.84,3.75,1.95,0]
Score_final=[0.854960689139906, 0.854960689139906, 0.8966059748084635, 0.9462915273089094, 0.9530266606222897, 0.9529961562631264, 0.9517440421861921, 0.9527957075525029, 0.9527964141115488, 0.9560536534393609, 0.9579422217011649, 0.9579422217011649, 0.95794259584465, 0.9600912200491002, 0.9600911493057189, 0.9600911480906217, 0.960091277840504, 0.9600911502238103, 0.960089289164972]
Time=[(62.23-i) for i in Time]

import matplotlib.pyplot as plt

x_axis_data = list(range(2,21))  # x
y_axis_data = Time  # y
plt.plot(x_axis_data, y_axis_data, linewidth=1, label='acc')  # 'bo-'表示蓝色实线，数据点实心原点标注
## plot中参数的含义分别是横轴值，纵轴值，线的形状（'s'方块,'o'实心圆点，'*'五角星   ...，颜色，透明度,线的宽度和标签 ，

plt.legend()  # 显示上面的label
plt.xlabel('Iteration')  # x_label
plt.ylabel('Time')  # y_label

# plt.ylim(-1,1)#仅设置y轴坐标范围
plt.show()